docs/posts/2016-11-09-interesting-times.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interesting Times</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Interesting Times</h1>
<p class="subtitle" role="doc-subtitle">Nov 08, 2016</p>
</header><p>
There are three statements that have become known as the &ldquo;Chinese&rdquo; curses, although I should point out that there is no record of any Chinese equivalents. They are three things to wish upon one&rsquo;s enemies. Three things that, on the surface, seem like things that a person should surely want; but appearances, as we all know, are often deceiving.
</p>

<p>
The first, and the mildest: &ldquo;May you live in interesting times.&rdquo; 
</p>

<p>
There are worse things, however, than simply living in interesting times. It is far worse to be at the center of those interesting events. Hence, the more severe curse: &ldquo;May you come to the attention of powerful people.&rdquo; 
</p>

<p>
There are times, though, when even that is not enough. For those times, you need the most severe curse, something devilishly cruel and viciously twisted: &ldquo;May you find what you are looking for.&rdquo;
</p>

<p>
Early this morning, Donald Trump delivered his acceptance speech after winning the 2016 United States presidential election. 
</p>

<p>
These are interesting times indeed.
</p>



<div class="tagline" id="orgd8f414b">
<p>
Tagged: <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
